nob-45/esp32s3/sdkconfig.defaults
# SmartElderCare 项目默认配置（ESP32-S3-DevKitC-1 N16R8）

# 目标芯片
CONFIG_IDF_TARGET="esp32s3"

# Flash 大小 8MB (实测板子为 8MB Flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# 启用 PSRAM (Octal 8MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU 频率
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS Tick 1000Hz
CONFIG_FREERTOS_HZ=1000

# 分区表 (使用自定义)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 串口波特率
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
